---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.ToposolidSlopeExceedsThreshold
source: html/0109bb6f-5cae-c271-989d-54be8b081669.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.ToposolidSlopeExceedsThreshold Property

Thickness of this Toposolid may be slightly inaccurate due to extreme Shape Editing. Dimensions to this element in
 sections and details may not accurately indicate the Thickness shown in Type Properties.

## Syntax (C#)
```csharp
public static FailureDefinitionId ToposolidSlopeExceedsThreshold { get; }
```